# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# proposed backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, EGPN, [128]], # 256 
   [-1, 1, Conv, [256, 1, 1]],  # 5
         
   [-1, 1, MP, []], #6-P3/8
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 10 
   [-1, 1, EGPN, [256]],
   [-1, 1, Conv, [512, 1, 1]],  # 12
         
   [-1, 1, patch_wise_attention_layer, [512, 2]], #13- P4/1
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 17-P4/16  
   [-1, 1, EGPN, [512]],
   [-1, 1, Conv, [1024, 1, 1]],  # 19 
         
   [-1, 1, patch_wise_attention_layer, [1024, 2]],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 24-P5/32  
   [-1, 1, EGPN, [1024]],
   [-1, 1, Conv, [1024, 1, 1]],  # 26
  ]


head:
  [[-1, 1, SPPCSPC, [512]], # Neck 27

   [-1, 1, Conv, [256, 1, 1]], #  [256 20 20]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # [256, 40, 40]
   [19, 1, Conv, [256, 1, 1]],
   [[-1, -2], 1, Concat, [1]],  # 31

   [-1, 1, Conv, [512, 1, 1]], #  [512 40 40]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # [512 80 80]
   [[-1, 12], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [256, 1, 1]],  # 35 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 31], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3, [512, 1, 1]],  # 38 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 27], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [1024, 1, 1]],  # 41 (P5/32-large)

   [35, 1, RepConv, [256, 3, 1]],
   [38, 1, RepConv, [512, 3, 1]],
   [41, 1, RepConv, [1024, 3, 1]],

   [[42, 43, 44], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]